#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьФорму(Форма) Экспорт 
// {{ ДЗ2_ДоработкаТиповыхКонфигураций 

	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаИКомандуПересчитать(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
// }} ДЗ2_ДоработкаТиповыхКонфигураций	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
// {{ ДЗ2_ДоработкаТиповыхКонфигураций 
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДорабКЛ_КонтактноеЛицо";
// }} ДЗ2_ДоработкаТиповыхКонфигураций	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
// {{ ДЗ2_ДоработкаТиповыхКонфигураций 
	            
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДорабКЛ_КонтактноеЛицо";
 // }} ДЗ2_ДоработкаТиповыхКонфигураций
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
// {{ ДЗ2_ДоработкаТиповыхКонфигураций 
	            
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.Основание);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДорабКЛ_КонтактноеЛицо";
 // }} ДЗ2_ДоработкаТиповыхКонфигураций
КонецПроцедуры


Процедура ДобавитьПолеСогласованнаяСкидкаИКомандуПересчитать(Форма)
// {{ ДЗ2_ДоработкаТиповыхКонфигураций 

    КомандаПересчитать = Форма.Команды.Добавить("ДорабКЛ_Пересчитать");
	КомандаПересчитать.Заголовок = "Пересчитать";
	КомандаПересчитать.Действие = "ДорабКЛ_Пересчитать";
	
	Группа = Форма.Элементы.Добавить("ДорабКЛ_ГруппаФормы", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
	
	ПолеВвода = Форма.Элементы.Добавить("ЭлементДорабКЛ_СогласованнаяСкидка", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным =  "Объект.ДорабКЛ_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДорабКЛ_СогласованнаяСкидкаПриИзменении");
	
	Кнопка = Форма.Элементы.Добавить("ДорабКЛ_Кнопка", Тип("КнопкаФормы"), Группа);
	Кнопка.ИмяКоманды = "ДорабКЛ_Пересчитать";
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
// }} ДЗ2_ДоработкаТиповыхКонфигураций	
КонецПроцедуры
#КонецОбласти
